Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱམས་པ་ཆེན་པོ་ཡང་འཐོབ་བོ། །སྙིང་རྗེ་ཆེན་པོ་ཡང་འཐོབ་བོ།
en: The bodhisattva mahāsattvas who are established in this dhāraṇī entranceway that is the form of omniscience will attain great kindness, and they will attain great compassion.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་གཟུངས་འདི་འཐོབ་པར་གྱུར་པ་དེས་གལ་ཏེ་མཚམས་མེད་པ་ལྔའི་ལས་ཤིག་སྤྱད་པར་གྱུར་ན་ཡང་དེའི་ཚེ་ཕྱི་མ་ལ་ཡོངས་སུ་ཟད་པར་གྱུར་ཏེ། ཚེ་གསུམ་གྱིས་ལས་དེ་དག་མ་ལུས་པར་ཟད་པར་འགྱུར་ཞིང་ས་བཅུ་པ་ཡང་གནོན་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་དེས་མཚམས་མེད་པའི་ལས་དག་མ་བྱས་ནའང་དེའི་ལས་གཞན་ཐམས་ཅད་ཡོངས་སུ་ཟད་པར་འགྱུར་ཞིང་།
en: Even if the bodhisattvas who obtain this dhāraṇī have committed the five actions with immediate results at death, that karma will be diminished in the next lifetime and will be totally eliminated in three lifetimes, and they will enter the tenth bhūmi.

source: ཚེ་རྗེས་ནས་ཀྱང་ས་བཅུ་པ་གནོན་པར་བྱེད་དེ་རིང་པོ་མི་ཐོགས་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་པོ་འདི་དག་ཀྱང་འཐོབ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱང་འཐོབ་པར་འགྱུར་རོ།
en: If the bodhisattvas have not committed the five actions with immediate results at death, all their other karma will be completely diminished, in their next life they will enter the tenth bhūmi, they will soon attain the thirty-seven factors of enlightenment, and they will attain the wisdom of an omniscient one. “

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གཅེས་སྤྲས་བྱེད་པ་ཡིན་ཏེ།
en: Therefore, noble son, this dhāraṇī entranceway that is the form of omniscience is very important for the bodhisattva mahāsattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་འཛུམ་པ་རྣམ་པར་བསྟན་པའི་ཆོ་འཕྲུལ་མཐོང་ན།
en: The bodhisattva mahāsattvas continually see the miraculous manifestation of the bhagavat buddhas smiling.

source: གང་གིས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ལ་མཆོད་པ་བྱས་ལ།
en: They will make offerings to buddhas as numerous as the grains of sand in the Ganges River, who are in realms as numerous as the grains of sand in the Ganges River.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཆོས་ཉན་ཅིང་།
en: They will listen to the Dharma from these buddhas.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། བཟོད་པ་ཐོབ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཉིད་དུ་ཕྱིར་འོང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་ཡུལ་དང་ཡང་ལྡན་པར་འགྱུར་རོ།
en: They will attain samādhi, dhāraṇī, and acceptance, and they will return to this buddha realm. The bodhisattva mahāsattvas will have that range of miraculous powers. “

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པ་འདི་ནི་ལས་ཡོངས་སུ་ཟད་པར་བྱེད་པ་དང་།
en: Noble son, this dhāraṇī entranceway that is the form of omniscience of bodhisattva mahāsattvas will completely diminish karma and increase virtue.

source: དགེ་བ་མངོན་པར་འཕེལ་བར་བྱེད་པས་ན་དོན་ཆེ་བ་ཡིན་ནོ།
en: Therefore, it has great benefit. “

source: །རིགས་ཀྱི་བུ་གང་དག་གིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཟླ་བ་དམ་པ་དེའི་མཚན་ཐོས་པ་དེ་དག་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་ཟད་པར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་ངེས་པར་འགྱུར་རོ།
en: Noble son, those who hear the name of the dhāraṇī entranceway that is the form of omniscience and hear the name of the Tathāgata Candrottama will diminish all their karmic obscurations and will definitely attain the highest, most complete enlightenment.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ནི་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ལས་གཟུངས་འདི་ཐོས་ཤིང་ཐོབ་ལགས་སོ།
en: Then some bodhisattvas said, “Bhadanta Bhagavat, we have heard and obtained this dhāraṇī from the bhagavat buddhas of the past who resided, lived, and remained in buddha realms in the ten directions as numerous as the grains of sand in the Ganges River.”

source: །ཁ་ཅིག་གིས་ནི་འདི་སྐད་ཅེས་བདག་ཅག་གིས་ནི་གང་གཱའི་ཀླུང་གཉིས་ཀྱི་བྱེ་མ་སྙེད་ལས་སོ་ཞེས་གསོལ་ཏོ།
en: Some others said, “…as numerous as the grains of sand in two Ganges Rivers.”

source: །ཁ་ཅིག་གིས་ནི་གསུམ་སྙེད་ལས་སོ་ཞེས།
en: Some others said, “…as numerous as the grains of sand in three Ganges Rivers.”

source: ཁ་ཅིག་གིས་ནི་བཞི་སྙེད་ལས་སོ་ཞེས།
en: Some others said, “…as numerous as the grains of sand in four Ganges Rivers.”

source: ཁ་ཅིག་གིས་ནི་ལྔ་སྙེད་ལས་སོ་ཞེས།
en: Some others said, “…as numerous as the grains of sand in five Ganges Rivers.”

source: ཁ་ཅིག་གིས་ནི་དྲུག་སྙེད་ལས་སོ་ཞེས།
en: Some others said, “…as numerous as the grains of sand in six Ganges Rivers.”

source: ཁ་ཅིག་གིས་ནི་བདུན་སྙེད་ལས་སོ་ཞེས།
en: Some others said, “…as numerous as the grains of sand in seven Ganges Rivers.”

source: ཁ་ཅིག་གིས་ནི་བརྒྱད་སྙེད་ལས་སོ་ཞེས་གསོལ་ཏོ།
en: Some others said, “…as numerous as the grains of sand in eight Ganges Rivers.”

source: །ཁ་ཅིག་གིས་ནི་འདི་སྐད་དུ་བདག་ཅག་གིས་ནི་འདས་པའི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་གང་གཱའི་ཀླུང་དགུའི་བྱེ་མ་སྙེད་དག་ལས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་ཐོས་ཤིང་རྣམ་པ་ཐམས་ཅད་དུ་ཐོབ་ལགས་སོ་ཞེས་གསོལ་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་གསོལ་པ།
en: Some others said, “We have heard and obtained this dhāraṇī entranceway that is the form of omniscience from samyaksam­buddhas of the past who resided, lived, and remained in buddha realms in the ten directions as numerous as the grains of sand in nine Ganges Rivers.”

source: བདག་གིས་ནི་བསྐལ་པ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་འདས་པ་ན་བསྐལ་པ་ཆེན་པོ་ཀུན་ནས་སྒྲོལ་བ་ཞེས་བགྱི་བ་ཞིག་བྱུང་སྟེ། དེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཞེས་བགྱི་བར་གྱུར་པ་དེར་སངས་རྒྱས་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བགྱི་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་ཞིང་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ།
en: The bodhisattva mahāsattva Maitreya said, “As many eons ago as there are grains of sand in ten Ganges Rivers, during an eon called Saṃtāraṇa, there was a buddha realm called Sarvālaṅkāravibhūṣita, in which there was a buddha named Sālendrarāja, a tathāgata, an arhat, a samyaksam­buddha, one with wisdom and virtuous conduct, a sugata, a knower of the world, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat.

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དགེ་སློང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མཐའ་ཡས་པའི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་ཅིང་།
en: He was encircled by a saṅgha of many hundreds of thousands of millions of trillions of bhikṣus and was similarly encircled by countless bodhisattvas.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པས་ཡོངས་སུ་བསྐོར་བ་ཞིག་བྱུང་བས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་ཉིད་བཤད་པར་གྱུར་པ་ན།
en: He taught this dhāraṇī, which is the dhāraṇī entranceway that is the form of omniscience.

source: དེ་ལས་གཟུངས་འདི་ཐོས་ནས་བདག་གིས་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ཤིང་རྟོགས་པར་བགྱིས་ལགས་སོ།
en: From him I heard this dhāraṇī, meditated on it, and fully realized it. “

source: །དེ་བཞིན་དུ་བསྐལ་པ་ཚད་མ་མཆིས་པའི་ཡང་ཆེས་ཚད་མ་མཆིས་པ། གྲངས་མ་མཆིས་པའི་ཡང་ཆེས་གྲངས་མ་མཆིས་པ་དག་ལ་འདས་པའི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་གྲངས་མ་མཆིས་པ་དག་གིས་མཆོད་པར་བགྱིས་ནས།
en: Throughout innumerable, truly innumerable, countless, truly countless eons, I made offerings through countless bodhisattva miracles to the samyaksam­buddhas, the bhagavat buddhas who resided, lived, and remained in the past.

source: སངས་རྒྱས་རེ་རེ་ལས་ཀྱང་དགེ་བའི་རྩ་བ་ཚད་མ་མཆིས་པ་དང་། གྲངས་མ་མཆིས་པ་དང་། གཞལ་དུ་མ་མཆིས་པ་དང་། དཔག་ཏུ་མ་མཆིས་པ་དག་བསྲུངས་ཤིང་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡོངས་སུ་བཟུང་སྟེ།
en: With each buddha I planted innumerable, countless, indeterminable, measureless good roots and acquired an accumulation of merit.

source: དགེ་བའི་རྩ་བ་དེས་བདག་སངས་རྒྱས་སྟོང་ཕྲག་མང་པོ་དག་གིས་ལུང་བསྟན་ཀྱང་།
en: Because of those numerous good roots, I received prophecies from many thousands of buddhas.

source: བདག་ནི་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་དུས་ལ་ལྟ་ཞིང་འདི་ལྟར་ཡུན་རིང་པོར་འཁོར་བ་ན་འཁོར་བར་གྱུར་ཏེ།
en: It is because of my specific prayers that in terms of time, I have continued to circle in saṃsāra for a long time.

source: དེའི་སླད་དུ་བདག་འཁོར་བ་ན་འཁོར་ཞིང་། སྔར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པའི་སངས་མ་རྒྱས་ལགས་ཏེ།
en: That is why I circle in saṃsāra and have not attained the complete enlightenment of perfect buddhahood in the past.

source: ང་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱལ་ཚབ་ཏུ་དབང་བསྐུར་ནས། བདག་གི་ཤེས་རབ་ཀྱི་མགོ་ལ་རྣམ་པར་གྲོལ་བའི་ཅོད་པན་བཅིངས་ལགས་སོ།
en: Now the Bhagavat has consecrated me as his regent for the highest, most complete enlightenment, binding the turban of liberation upon my head of wisdom.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བྱམས་པ་དེ་དེ་བཞིན་ཏེ།
en: Then the Bhagavat said to the bodhisattva Maitreya, “It was thus, Maitreya.

source: ཁྱོད་ཀྱིས་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སཱ་ལའི་དབང་པོའི་རྒྱལ་པོ་ལས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པའི་གཟུངས་ཀྱི་སྒོ་ལ་འཇུག་པའི་གཟུངས་འདི་ཐོབ་པར་གྱུར་ཏོ།
en: You received from the tathāgata arhat samyaksam­buddha Sālendrarāja this dhāraṇī, which is the dhāraṇī entranceway that is the form of omniscience.

source: །བྱམས་པ་ཁྱོད་ནི་རེ་བ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་རྫོགས་པ་ཡིན་པས་བྱམས་པ་ཁྱོད་ནི་འདོད་ན་བསྐལ་པ་བཅུའི་བར་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་།
en: Maitreya, your hopes have been perfectly fulfilled. Maitreya, if you had desired it, you could have attained the complete enlightenment of perfect buddhahood within ten eons.

source: བྱམས་པ་ཁྱོད་ཀྱིས་ནི་མྱུར་བ་ཉིད་དུ་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་འདས་པའི་དབྱིངས་སུ་འཇུག་པར་ཡང་ནུས་མོད་ཀྱི།
en: Maitreya, you have the power to quickly enter the state of nirvāṇa without any remaining aggregates, which is the unsurpassable accumulation of wisdom.

source: བྱམས་པ་ཁྱོད་འདི་སྲིད་དུ་འཁོར་བ་ལ་མངོན་པར་དགའ་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་སྨོན་ལམ་གྱི་དབང་གིས་དུས་ལ་ལྟ་བ་ཡིན་ནོ།
en: But, Maitreya, you have preferred to remain in saṃsāra for such a long time because of the power of your prayer with regard to time.

source: །བྱམས་པ་དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ད་ལྟར་ང་ལས་རྒྱལ་ཚབ་ཡོངས་སུ་བླངས་པ་ཡིན་ཏེ།
en: Therefore, Maitreya, I have now made you my heir.

source: ཁྱོད་ཀྱིས་ནི་འདས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལས་ཀྱང་རྒྱལ་ཚབ་ཡོངས་སུ་བླངས་སོ།
en: The tathāgatas of the past have also made you their heir.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ལ་གཟིགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་།
en: Then the Bhagavat regarded the whole saṅgha.

source: དགེ་བསྙེན་མའི་འཁོར་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། མི་དང་། མི་མ་ཡིན་པ་རྣམས་ལ་རྣམ་པར་གཟིགས་ནས།
en: He regarded the gathering of bodhisattvas, bhikṣus, bhikṣuṇīs, upāsakas, upāsikās, devas, nāgas, yakṣas, rākṣasas, gandharvas, humans, and nonhumans.

source: དེའི་ཚེ་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་བཀའ་སྩལ་ཏོ། །དཱན་ཏ་བྷཱུ་མི། དམ་ཐ་བྷཱུ་མི། སྨྲྀ་ཏི་བྷཱུ་མི། པྲ་ཛྙཱ་བྷཱུ་མི། བཻ་ཤ་ར་དྱ་བྷཱུ་མི། པྲ་ཏི་སམ་བིད་བྷཱུ་མི། ཨ་ནུ་ཀྵེ་པ་བྷཱུ་མི། ས་མ་ཏཱ་པ་རཱི་ཀྵེ་པ། ཨུ་པེ་ཀྵྱ་བྷཱུ་མི། ཛ་ཏིཀྵ་ཡ་བྷཱུ་མི། མ་མུ་ཛ། མུན་ཛ། བིན་མུ་ཛ། མ་ལན་མུ་ཛ། བི་ཤ་ཀྲ། ད་ཤ་བ་ཏེ། བེ་ཤ་ཏ། ཏེ་ར་ཎ། བཻ་ཤལཱ་ཀྲ། ཤ་མུ་ཤ་བ་ཏ། བི་མ་ཏི། བི་མ་ཏི། ཡོ་པར་ཧི་ཏ། ར་ག་མ་ཏ། བ་ཤི་སང་ཀྲ་མ། ཨ་ཏི་ཙོ་རབ་ཏེ། མེ་ཁེ་མུ་དྲ། ད་ཧ་ར་བ་ཏེ། པྲ་ཛྙཱ་ཨ་ག་ཏཱ་བུད་ངྷེ། ད་ཧ་ཀྲ་མ་ཏི། ས་དོ་ཥ་བན་དྷ། བ་ལ་ཡ་ཏིལ་ཡ། ཨ་ཧུ་ཀ་ཊ། ཨ་མུན་དྷ་མན། ཨརྟ་བ་ཏི། མུ་རུ་བ་ཏི། དི་ཧཱི་ནད་བེ་དྷ། ཨ་ག་ན་དི། བ་ཀ་ན་ཏེ། ས་མ་ཀེ །བི་ས་བྷ་ཊེ། ཨི་ཊེ། ཨི་ཊ་བ་ལེ། ཨད་ཏྲ། ཏད་ཏྲ། ཀུ་རུ་ཥ་ཎ། ལ་བ་ཥ་ཎ། ལ་ཏ་ཐ། རུ་ཐ། སརྦ་ན་ཏ། སརྦ་ཏ་བ། ཨ་ནི་རུད་དྷ། ཨི་ད་ཤྭ་རི་ཧི་ཕ་ལ། བ་ཧུ་ཕ་ལ། ས་ཏྭ་ཕ་ལ། ཤིཥྚ་བ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་རྣམས་ལ་ཡང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་ལྡན་པའི་མོས་པའི་ཚིག་རྣམས་བཤད་དེ།
en: At that time, he recited these mantra words: dānta­bhūmiḥ damatha­bhūmiḥ smṛti­bhūmiḥ prajñā­bhūmirvaiśāradya­bhūmiḥ prati­saṃvid­bhūmi­ranutkṣepa­bhūmiḥ samatāpari­kṣayopekṣa­bhūmirjātikṣaya­bhūmirmanuja vinmujaḥ malanmujaḥ visāgraḥ daśāvate veśataḥ teraṇa vesalagra śamuśavataḥ vimati vimati yopahira regamata vasisakrama iticāravate mekhemudra daharavate prajñākṣābubu dahakramitā sadoṣavantaḥ elaya tilaya ahusuṭā amundhamaṃ arthavati muruvati tehīnadvivā akaneti bakanate samake visābhaṭe iṭe iṭabale atra tatra kuruṣaṃ laruṣaṃ latatha katha sarvantaḥ sarvatarvaḥ aniruddhaḥ dihakhaṭambiphala bahuphala śataphala śīṣṭavate || The Bhagavat recited to the devas these words of aspiration, which have the power to produce a result.

source: དེ་དག་བཤད་པ་ན་ལྷ་ཁྲག་ཁྲིག་ཕྲག་དྲུག་ཅུས་བདེན་པ་མཐོང་བར་གྱུར་ཏོ། །ཏད་ཕ་ལན། ཨ་གྲ་ཕ་ལན། ལ་ལ་ཧུ། ཨ་ལ་ཧུ། ཨ་ལ་ཧ། ནི་ལང་ཧ་རེ། བ་ན་ཏ་ཁྱེ། ཨི་དན་ཕ་ལན། ནི་ཡཱ་མ་ཕ་ལན། ན་མུ་ད་ཡ།
en: When he recited them, six trillion devas saw the truth.

source: བི་བྷཱུ་ཁ། པྲ་ཛྙཱ་ཙཀྲ་སུ་ནིར་པྲྀ་ཏི་ཙཀྲ། ཛྙཱ་ན་ཙཀྲ། མོས་པའི་ཚིག་དེ་དག་གིས་ལྷ་དུང་ཕྱུར་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་དེ་ཉིད་དུ་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །པ་ཤྱེ། སོ་མ་ཏོ། །ཨ་ནུ་མ་ཏོ། །ཨ་ཀུ་མ་ཏི། ཚེ་ད་བ་ཀཻ། མན་ཏྲ་སྠ། ད་ཤ་བ་ལ། བི་བྲ་བ་སྠ། ཨི་ཤ་སྠི་ཏ། ཨ་ཏི་མ་ཏི། ཏཱིཀྵྞ་མ་ཏི།
en: agraphalam lalaha laha nilaṃhare vacatakhyā idaṃphalaṃ niyāmaphalaṃ namudaya vibhūkha prajñācakra sunirvṛticakra jñānīcakra || These words of aspiration caused a hundred million devas to develop the aspiration for complete enlightenment, and they became irreversible.

source: ཨཱ་ལོ་ཀེ །སྟེ་རི་ཏུཥྞ། མོས་པའི་ཚིག་དེ་དག་གིས་ཀླུ་དྲུག་ཁྲི་བཞི་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་དེ་ཉིད་དུ་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །ཨ་པྲ་བྷ། ས་མ་ད་ན། ཨ་ཧད་དྱོ། བྷ་ག་བད་དྱོ། ཀཱ་རུ་ཎྱ་ཨ་ཀྵ། སིད་དྷ་མ་ཏི། ས་མན་ཏཱ་ཀྵོ། ཨ་ལ་བ་ལེ། སི་ཏ་ཀ་རོ། མ་ཧ་བ་ལེ། ཨོ་ཇོ་ཧ་རོ། དྷ་ར་ནེ། པིང་གེ་ལ་ཀྵ། ཨུ་དཱཀྵ། ཀུ་ཀཀྵ། བི་རོ་དྷོ། བི་རཱུ་པ་མུ་ཁ། ཨ་ཀྵི་ཧསྟ། ཤག་ཏི་བ་ལན།
en: paśye somato anumato akumato akumati chedavakai mantrastha daśabala vipravastha iśasthita atimati tīkṣṇamati āloko sterituṣṇa || These words of aspiration caused 64,000 nāgas to develop the aspiration for complete enlightenment, and they became irreversible.

source: ཨ་སུ་རོ་བི་ནཱྃ། ཨ་སུ་རོ་བི་ནཱྃ། ཨ་སུ་རོ་པྲ་མར་དི་ཏེ། མོས་པའི་ཚིག་དེ་དག་གིས་གནོད་སྦྱིན་དུང་ཕྱུར་ཕྲག་གཉིས་དང་བྱེ་བ་ཕྲག་གཉིས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་དེ་ཉིད་དུ་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །ཨ་ཙི་པི་ལི་ལེ། ཏི་ནི་ད་ཚེ། སན་དི་ད་ཚེ། ག་ཏི་ནེ་ན། ཀ་མེ་མ། ན་མ་སྟེ། ཨུ་བཻར་བེ། མུ་ད་མེ། མ་ད་མེ། མ་ཏི་མེ། ས་ནི་ཧ། ཤཱུ་རེ། དྷཱ་ར་ཎཱི་ཡ། སེན་དྲ། ས་དེ་བ། ས་ནཱ་ག །ས་ཡཀྵ། ཨ་སུ་ར། དེ་བཱ། ནཱ་གཱ། ནི་རུག་ཏི། བ་རི་བཱ་ར། ནི་རུ་ག་ཏིལ་བྷི། སྨྲྀ་ཏི་པྲཛྙཱ་པ་རི་བཱ་ར། མ་ཏི་
en: aprabhā samadanā ahadyo bhagavadyo karaṇyākṣa siddhamati samantakṣau alabale piṭakaro mahābale ojadaro dharaṇe migalekṣe udākṣa kudākṣa kukākṣa viroyo virūpamukha akṣihasta saṃkṣibala asurovina asuropramardane || These words of aspiration caused 220,000,000 yakṣas to develop the aspiration for complete enlightenment, and they became irreversible.

source: པྲ་ཏི་ལ་བྷི། ག་ཏི་དྷྲྀཏི། པ་རི་བཱ་ར། ག་ཏི་དྷྲྀ་ཏི། པྲ་ཏི་ལ་བྷི། པཱུརྦ་ཀེ་ཥུ། ཙ་རི་ཏ་བ་ན་ཏཿ། ཨ་བྷི་སྠཱ་མ་བན་ཏཿ། ཤཱུ་ར་བན་ཏཿ། ཙི་ར་བཱིརྱ་བན་ཏཿ། པི་ཏཱ་བ་ཏེ། བྷཱ་ས་བྷ་གེ། མཱརྒ་མུ་དྲེ། དྲྀ་ཤ་པ་ཀ་རི་ཥ་ཎི། ཀྵ་མ་ར་ཧུ། ཨོ་ཧ་ར་ཎོ། དེ་བར་ཙ་ཏུ། སུ་ར་མུ་དྲ། ཡཀྵ་མུ་དྲ། རཀྵ་ས་མུ་དྲ། བེ་དི་བེ་དི་མེ། ཏབ་པེ། ཏད་ཏ་བ་པེ། ཨུཥྞ་ན་མེ། པྲ་ཁད་ཏྱེ། ནན་པེ། དྷཱ་རི་ཎཱི་ཡ། ཨཱ་བི་ཤ། །དི་ཤ་ཤོ་དྷ་ནི། བཱུ་ཀྱ་ཤུད་དྷེ། ཛི་ཧྭ་ཤུད་དྷེ། བཱ་ཙཱི་བ་རི་ཀརྨ། པྲ་ཛྙཱ་བུད་དྷི། སྨྲྀ་ཏི་མ་ཏི། ག་ཏི་དྷྲྀ་ཏི། ག་ཎ་ན། པྲ་ཏི་ས་ར་ཎ་བུད་དྷི། ཛ་ཡ་ཙཀྲེ། ཤཱུ་ནྱ་ཏ་ཙཀྲེ་བྱ་ཡ། མོས་པའི་ཚིག་དེ་དག་གིས་ལྷ་མ་ཡིན་ལྔ་ཁྲི་དྲུག་སྟོང་གིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: arthe pilile tinithe saṃtīrthe katitene nakeme nanamaste ubherabhe mudame madame matime saniha śūre dhāraṇīya sendra sadeva sanāga sayakṣāsuradevā nāga nirukti parivāra niruktalāni smṛti prajñā parivāramati pratilābhī gati­dhṛtiparivāra gati­dhṛtilābhīḥ pūrvakeṣu hiteṣu caritavantaḥ abhi­skāmavantaḥ śūravantaḥ ciravīryavantaḥ bhītavantaḥ sitabhāge mārgamudra diśāpakarṣaṇi kṣaparahu oharaṇo devaracatu suramudra yakṣamudra rākṣasamudra vedivedime tape tattape uṣṇāname prakhādye nanava dhāraṇīya āviśa diśāśodhane vākyaśuddhe jihvāśuddhe vāciparikarmaḥ prajñā buddhi smṛti mati gati dhṛti gaṇana pratisaraṇabuddhiḥ jayacakre śūnyacakre vyaya || These words of aspiration caused 56,000 asuras to develop the aspiration for complete enlightenment, and they became irreversible.

source: ཕྱིར་མི་ལྡོག་པ་ལ་གནས་པར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འཇིགས་མེད་ཡང་དག་གཞོལ་ཞེས་བྱ་བ་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བ་ནི་རྙེད་པར་དཀའོ།
en: Then the Bhagavat addressed the bodhisattva named Vaiśāradyasamavasaraṇa: “Noble son, it is difficult to encounter a tathāgata arhat samyaksam­buddha’s appearance in the world.

source: །ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བས་ཡོངས་སུ་བསྒོས་པའི་གསང་སྔགས་ཀྱི་གཞི་འདི་དག་ཀྱང་རྙེད་པར་དཀའོ།
en: It is also difficult to find these mantra words that are imbued with correct conduct, samādhi, wisdom, liberation, and the vision of the wisdom of liberation. “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ལ་ཕན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བསྒྲུབ་པའི་ཕྱིར། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། སྦྱིན་པ་དང་།
en: Noble son, the tathāgatas, in order to benefit beings and to accomplish the qualities of a bodhisattva, previously engaged in bodhisattva conduct.

source: དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། ཏིང་ངེ་འཛིན་དང་།
en: They possessed generosity, restraint, self-control, patience, diligence, samādhi, and wisdom.

source: ཤེས་རབ་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་རྣམས་ལ་བསྙེན་བཀུར་བྱས་ཏེ། ལ་ལ་ལས་ནི་སྦྱིན་པ་བྱིན།
en: They served many hundreds of thousands of millions of trillions of buddhas.

source: ལ་ལ་ལས་ནི་ཚུལ་ཁྲིམས་བསྲུངས། ལ་ལ་ལས་ནི་ཚངས་པར་སྤྱོད་པ་སྤྱད། ལ་ལ་ལས་ནི་སྒོམ་པ་བསྟེན། ལ་ལ་ལས་ནི་བརྩོན་འགྲུས་བརྩམས། ལ་ལ་ལས་ནི་བཟོད་པ་བསྒོམས།
en: Some performed acts of generosity, some maintained correct conduct, some led a celibate life, some practiced meditation, some engaged in diligence, some meditated on patience, some accomplished samādhi, and some cultivated wisdom.

source: ལ་ལ་ལས་ནི་ཏིང་ངེ་འཛིན་བསྒྲུབས། ལ་ལ་ལས་ནི་ཤེས་རབ་སྟེན་ཅིང་། དགེ་བའི་ལས་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་མང་དུ་བྱས་པས།
en: They performed many countless, various, different good actions.

source: དེའི་ཕྱིར་ངས་ད་ལྟར་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་སོ།
en: It is in that way that I, too, have now attained unsurpassable wisdom. “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན།
en: Noble son, the tathāgatas previously followed the conduct of a bodhisattva for many hundreds of thousands of millions of trillions of eons.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མར་བརྫུན་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་མོ་དང་། ཚིག་ཀྱལ་པ་སྤངས་ཏེ།
en: They refrained from lying, slander, harsh speech, and idle talk.

source: ངག་གི་ལས་དགེ་བ་རྣམ་པ་དུ་མ་བསྟེན་ཅིང་མང་དུ་བྱས་པས།
en: They cultivated virtuous speech of many different kinds.

source: དེའི་ཕྱིར་ད་ལྟར་ལྗགས་ཤིན་ཏུ་རིང་བ་བརྙེས་ཏེ།
en: Therefore, they have now obtained long tongues.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ནི་གཞན་དུ་གསུང་བ་མི་མངའོ།
en: Noble son, the tathāgata arhat samyaksam­buddhas do not speak in any other way.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་དེར་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་འདུ་བྱ་བ་མངོན་པར་མཛད་པས།
en: Then the Bhagavat performed a miraculous deed for his retinue.

source: ཏིང་ངེ་འཛིན་བསོད་ནམས་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་ནས། ཞལ་གྱི་སྒོ་ནས་ལྗགས་ཀྱི་དབང་པོ་ཕྱུང་སྟེ།
en: He performed the miraculous deed of resting in the gathering of all merit samādhi and extending his tongue from his mouth and covering his face with it.

source: རང་གི་ཞལ་གྱི་དཀྱིལ་འཁོར་རབ་ཏུ་ཡོག་པར་མཛད་ནས་ལྗགས་ཀྱི་དབང་པོ་དེ་ལས་འོད་ཟེར་བྱེ་བ་ཕྲག་དྲུག་ཅུ་རབ་ཏུ་ཕྱུང་སྟེ།
en: That tongue radiated 600,000,000 light rays.

source: འོད་ཟེར་དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་པ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་མཛད་དོ།
en: Those light rays filled the worlds of this billion-world universe with a bright radiance.

source: །འོད་ཟེར་དེ་དག་གིས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ལྷ་དང་། མི་རྣམས་ལ་ཁྱབ་པར་གྱུར་ཏེ།
en: Those light rays illuminated the hells, animals, Yama worlds, devas, and humans.

source: འོད་ཟེར་དེ་དག་གིས་སེམས་ཅན་དམྱལ་བའི་སེམས་ཅན་མེ་རབ་ཏུ་འབར་བས་ལུས་སྲེག་པ་གང་ཡིན་པ་དེ་དག་རླུང་བསིལ་བ་དག་ལངས་ནས་དེ་དག་ལ་རེག་པ་དང་། དེ་དག་ཡུད་ཙམ་ཞིག་བདེ་བའི་ཚོར་བ་སྐྱེས་པར་གྱུར་ཏོ།
en: Those light rays blew as cool breezes onto the beings in hell, whose bodies were being burned by blazing fires. The instant those breezes touched them, there arose for them a sensation of bliss.

source: །སེམས་ཅན་དམྱལ་བའི་སེམས་ཅན་རེ་རེའི་མདུན་ན་ཡང་སངས་རྒྱས་ཀྱིས་སྤྲུལ་པ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྐུ་ལེགས་པར་བརྒྱན་ཅིང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་གཟུགས་རྣམ་པར་མཛེས་པར་གྱུར་པ་དག་བཞུགས་ཏེ།
en: Before each being in hell there appeared an emanation of the Buddha, with a body adorned by the thirty-two signs and glorious with the eighty excellent features of a great being.

source: སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་དེ་དག་གིས་དེ་མཐོང་ནས། བདེ་བ་དང་ལྡན་ཞིང་སངས་རྒྱས་མཐོང་བའི་བདེ་བས་ལུས་རབ་ཏུ་ཚིམ་སྟེ། སངས་རྒྱས་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་ཅན་འདིའི་མཐུས་བདག་ཅག་གིས་བདེ་བའི་ཚོར་བ་ཐོབ་བོ་སྙམས་དུ་སེམས་ཏེ། དེ་དག་བཅོམ་ལྡན་འདས་ལ་དགའ་ཞིང་དང་ལ་གུས་པ་སྐྱེས་པ་དང་།
en: When the beings in hell saw them, they were endowed with bliss, their bodies were refreshed by seeing the Buddha, and on seeing the Buddha they thought, “It is through the power of this being that I have gained this experience of bliss,” and they had affection, delight, and respect for the appearance of the Bhagavat.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་བཀའ་སྩལ་པ། ཀྱེ་སེམས་ཅན་དག་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ། །ཆོས་ལ་ཕྱག་འཚལ་ལོ། །དགེ་འདུན་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་དེ་སྐད་བརྗོད་ཅིག་དང་རྟག་ཏུ་དེ་ལྟ་བུའི་བདེ་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: The Bhagavat said to them, “O beings! Say these words: ‘Homage to the Buddha, homage to the Dharma, homage to the Saṅgha,’ and you will always have this kind of bliss.”

source: །དེ་ནས་སེམས་ཅན་དམྱལ་བ་པ་དེ་དག་གིས་ཐལ་མོ་སྦྱར་ནས་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ།
en: Those hell beings then placed their palms together and recited, “Homage to the Buddha!

source: །ཆོས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Dharma!

source: །དགེ་འདུན་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་དེ་སྐད་བརྗོད་དོ།
en: Homage to the Saṅgha!”

source: །དེ་ནས་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་དེ་དག་དགེ་བའི་རྩ་བ་དེ་དང་། སེམས་དང་བ་དེས་དེ་ནས་ཤི་འཕོས་ནས། ཁ་ཅིག་ནི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་སོ། །ཁ་ཅིག་ནི་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་སོ།
en: Because of that virtuous root and pure motivation, those hell beings departed that life, some to be born among devas and some among humans.

source: །གང་དག་གྲང་བའི་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་ལ་ནི་རླུང་དྲོན་པོ་དག་ལངས་ནས་སྔ་མ་བཞིན་དུ་མི་རྣམས་ཀྱི་བར་དུ་སྐྱེས་སོ།
en: The light rays came as warm winds to those who had been born within the cold hells, and so on, as just described, up until those who had been born among humans.

source: །དེ་བཞིན་དུ་ཡི་དགས་བཀྲེས་པ་དང་སྐོམ་པས་ལུས་རབ་ཏུ་འབར་བར་གྱུར་པ་དེ་དག་ཀྱང་འོད་ཟེར་དེ་དག་གིས་བཀྲེས་པ་དང་སྐོམ་པའི་མེ་ཞི་བར་བྱེད་ཅིང་བདེ་བའི་ཚོར་བ་སྐྱེད་དེ།
en: In the same way, when the light rays touched the pretas, whose bodies were burning with hunger and thirst, they extinguished the fire of hunger and thirst, and the pretas experienced bliss.

source: ཡི་དགས་རེ་རེའི་མདུན་ན་ཡང་སངས་རྒྱས་ཀྱི་སྤྲུལ་པའི་གཟུགས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྐུ་ལེགས་པར་བརྒྱན་ཅིང་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་རྣམ་པར་མཛེས་པ་དག་བཞུགས་པར་གྱུར་ཏེ།
en: An emanation of the Buddha, whose body was adorned by the thirty-two signs and glorious with the eighty excellent features of a great being, appeared before each preta.
